{
  "architectures": [
    "BertForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.3,
  "classifier_dropout": null,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.3,
  "hidden_size": 512,
  "id2label": {
    "0": "Remember",
    "1": "Understand",
    "2": "Apply",
    "3": "Analyze",
    "4": "Evaluate",
    "5": "Create"
  },
  "initializer_range": 0.02,
  "intermediate_size": 2048,
  "label2id": {
    "Analyze": 3,
    "Apply": 2,
    "Create": 5,
    "Evaluate": 4,
    "Remember": 0,
    "Understand": 1
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 8,
  "num_hidden_layers": 4,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "problem_type": "single_label_classification",
  "torch_dtype": "float32",
  "transformers_version": "4.55.0",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 30522
}
